; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/sokoban/domain.pddl
;; updates:
;;   - only focus on microban instances, hence 4 constant directions
;;
(define (domain sokoban)
(:requirements :typing)
(:types location direction box)

(:constants down up left right - direction)

(:predicates
             (at-robot ?l - location)
             (at ?o - box ?l - location)
             (adjacent ?l1 - location ?l2 - location ?d - direction) 
             (clear ?l - location)
)

(:action move
:parameters (?from - location ?to - location ?dir - direction)
:precondition (and (clear ?to) (at-robot ?from) (adjacent ?from ?to ?dir))
:effect (and (at-robot ?to) (not (at-robot ?from)))
)
             

(:action push
:parameters  (?rloc - location ?bloc - location ?floc - location ?dir - direction ?b - box)
:precondition (and (at-robot ?rloc) (at ?b ?bloc) (clear ?floc)
	           (adjacent ?rloc ?bloc ?dir) (adjacent ?bloc ?floc ?dir))

:effect (and (at-robot ?bloc) (at ?b ?floc) (clear ?bloc)
             (not (at-robot ?rloc)) (not (at ?b ?bloc)) (not (clear ?floc)))
)
)

; problem
;; grid_size=10, boxes=2, out_folder=training/easy, instance_id=47, seed=76
;;
;;   #  #  #  #  #  #  #  #  #  #
;;   #  .  #  #  .  #  #  .  #  #
;;   #  #  .  .  #  #  .  #  .  #
;;   #  .  #  +  +  #  .  G  .  #
;;   #  .  + 1+  +  +  +  +  .  #
;;   #  .  G  +  +  + 2+  +  #  #
;;   #  #  +  +  +  +  + R+  #  #
;;   #  #  .  #  .  .  +  +  .  #
;;   #  .  .  #  #  .  #  .  #  #
;;   #  #  #  #  #  #  #  #  #  #
;; 

(define (problem sokoban-47)
 (:domain sokoban)
 (:objects 
    loc_1_1 loc_1_2 loc_1_3 loc_1_4 loc_1_5 loc_1_6 loc_1_7 loc_1_8 loc_1_9 loc_1_10 loc_2_1 loc_2_2 loc_2_3 loc_2_4 loc_2_5 loc_2_6 loc_2_7 loc_2_8 loc_2_9 loc_2_10 loc_3_1 loc_3_2 loc_3_3 loc_3_4 loc_3_5 loc_3_6 loc_3_7 loc_3_8 loc_3_9 loc_3_10 loc_4_1 loc_4_2 loc_4_3 loc_4_4 loc_4_5 loc_4_6 loc_4_7 loc_4_8 loc_4_9 loc_4_10 loc_5_1 loc_5_2 loc_5_3 loc_5_4 loc_5_5 loc_5_6 loc_5_7 loc_5_8 loc_5_9 loc_5_10 loc_6_1 loc_6_2 loc_6_3 loc_6_4 loc_6_5 loc_6_6 loc_6_7 loc_6_8 loc_6_9 loc_6_10 loc_7_1 loc_7_2 loc_7_3 loc_7_4 loc_7_5 loc_7_6 loc_7_7 loc_7_8 loc_7_9 loc_7_10 loc_8_1 loc_8_2 loc_8_3 loc_8_4 loc_8_5 loc_8_6 loc_8_7 loc_8_8 loc_8_9 loc_8_10 loc_9_1 loc_9_2 loc_9_3 loc_9_4 loc_9_5 loc_9_6 loc_9_7 loc_9_8 loc_9_9 loc_9_10 loc_10_1 loc_10_2 loc_10_3 loc_10_4 loc_10_5 loc_10_6 loc_10_7 loc_10_8 loc_10_9 loc_10_10 - location
    box1 box2 - box
    )
 (:init 

    (at-robot loc_7_8)
    (at box1 loc_5_4)
    (at box2 loc_6_7)
    (clear loc_4_5)
    (clear loc_4_2)
    (clear loc_4_8)
    (clear loc_6_5)
    (clear loc_5_7)
    (clear loc_6_2)
    (clear loc_6_8)
    (clear loc_3_3)
    (clear loc_3_9)
    (clear loc_8_5)
    (clear loc_7_3)
    (clear loc_8_8)
    (clear loc_7_6)
    (clear loc_5_3)
    (clear loc_5_6)
    (clear loc_4_4)
    (clear loc_5_9)
    (clear loc_4_7)
    (clear loc_6_4)
    (clear loc_9_3)
    (clear loc_9_6)
    (clear loc_7_5)
    (clear loc_7_8)
    (clear loc_8_7)
    (clear loc_5_2)
    (clear loc_5_8)
    (clear loc_6_3)
    (clear loc_5_5)
    (clear loc_4_9)
    (clear loc_6_6)
    (clear loc_9_2)
    (clear loc_9_8)
    (clear loc_2_2)
    (clear loc_2_5)
    (clear loc_3_4)
    (clear loc_2_8)
    (clear loc_3_7)
    (clear loc_8_3)
    (clear loc_7_7)
    (clear loc_8_6)
    (clear loc_7_4)
    (clear loc_8_9)
    (adjacent loc_3_3 loc_3_4 right)
    (adjacent loc_3_4 loc_4_4 down)
    (adjacent loc_3_4 loc_3_3 left)
    (adjacent loc_3_7 loc_4_7 down)
    (adjacent loc_3_9 loc_4_9 down)
    (adjacent loc_4_2 loc_5_2 down)
    (adjacent loc_4_4 loc_5_4 down)
    (adjacent loc_4_4 loc_3_4 up)
    (adjacent loc_4_4 loc_4_5 right)
    (adjacent loc_4_5 loc_5_5 down)
    (adjacent loc_4_5 loc_4_4 left)
    (adjacent loc_4_7 loc_5_7 down)
    (adjacent loc_4_7 loc_3_7 up)
    (adjacent loc_4_7 loc_4_8 right)
    (adjacent loc_4_8 loc_5_8 down)
    (adjacent loc_4_8 loc_4_7 left)
    (adjacent loc_4_8 loc_4_9 right)
    (adjacent loc_4_9 loc_5_9 down)
    (adjacent loc_4_9 loc_4_8 left)
    (adjacent loc_4_9 loc_3_9 up)
    (adjacent loc_5_2 loc_6_2 down)
    (adjacent loc_5_2 loc_4_2 up)
    (adjacent loc_5_2 loc_5_3 right)
    (adjacent loc_5_3 loc_6_3 down)
    (adjacent loc_5_3 loc_5_2 left)
    (adjacent loc_5_3 loc_5_4 right)
    (adjacent loc_5_4 loc_6_4 down)
    (adjacent loc_5_4 loc_5_3 left)
    (adjacent loc_5_4 loc_4_4 up)
    (adjacent loc_5_4 loc_5_5 right)
    (adjacent loc_5_5 loc_6_5 down)
    (adjacent loc_5_5 loc_5_4 left)
    (adjacent loc_5_5 loc_4_5 up)
    (adjacent loc_5_5 loc_5_6 right)
    (adjacent loc_5_6 loc_6_6 down)
    (adjacent loc_5_6 loc_5_5 left)
    (adjacent loc_5_6 loc_5_7 right)
    (adjacent loc_5_7 loc_6_7 down)
    (adjacent loc_5_7 loc_5_6 left)
    (adjacent loc_5_7 loc_4_7 up)
    (adjacent loc_5_7 loc_5_8 right)
    (adjacent loc_5_8 loc_6_8 down)
    (adjacent loc_5_8 loc_5_7 left)
    (adjacent loc_5_8 loc_4_8 up)
    (adjacent loc_5_8 loc_5_9 right)
    (adjacent loc_5_9 loc_5_8 left)
    (adjacent loc_5_9 loc_4_9 up)
    (adjacent loc_6_2 loc_5_2 up)
    (adjacent loc_6_2 loc_6_3 right)
    (adjacent loc_6_3 loc_7_3 down)
    (adjacent loc_6_3 loc_6_2 left)
    (adjacent loc_6_3 loc_5_3 up)
    (adjacent loc_6_3 loc_6_4 right)
    (adjacent loc_6_4 loc_7_4 down)
    (adjacent loc_6_4 loc_6_3 left)
    (adjacent loc_6_4 loc_5_4 up)
    (adjacent loc_6_4 loc_6_5 right)
    (adjacent loc_6_5 loc_7_5 down)
    (adjacent loc_6_5 loc_6_4 left)
    (adjacent loc_6_5 loc_5_5 up)
    (adjacent loc_6_5 loc_6_6 right)
    (adjacent loc_6_6 loc_7_6 down)
    (adjacent loc_6_6 loc_6_5 left)
    (adjacent loc_6_6 loc_5_6 up)
    (adjacent loc_6_6 loc_6_7 right)
    (adjacent loc_6_7 loc_7_7 down)
    (adjacent loc_6_7 loc_6_6 left)
    (adjacent loc_6_7 loc_5_7 up)
    (adjacent loc_6_7 loc_6_8 right)
    (adjacent loc_6_8 loc_7_8 down)
    (adjacent loc_6_8 loc_6_7 left)
    (adjacent loc_6_8 loc_5_8 up)
    (adjacent loc_7_3 loc_8_3 down)
    (adjacent loc_7_3 loc_6_3 up)
    (adjacent loc_7_3 loc_7_4 right)
    (adjacent loc_7_4 loc_7_3 left)
    (adjacent loc_7_4 loc_6_4 up)
    (adjacent loc_7_4 loc_7_5 right)
    (adjacent loc_7_5 loc_8_5 down)
    (adjacent loc_7_5 loc_7_4 left)
    (adjacent loc_7_5 loc_6_5 up)
    (adjacent loc_7_5 loc_7_6 right)
    (adjacent loc_7_6 loc_8_6 down)
    (adjacent loc_7_6 loc_7_5 left)
    (adjacent loc_7_6 loc_6_6 up)
    (adjacent loc_7_6 loc_7_7 right)
    (adjacent loc_7_7 loc_8_7 down)
    (adjacent loc_7_7 loc_7_6 left)
    (adjacent loc_7_7 loc_6_7 up)
    (adjacent loc_7_7 loc_7_8 right)
    (adjacent loc_7_8 loc_8_8 down)
    (adjacent loc_7_8 loc_7_7 left)
    (adjacent loc_7_8 loc_6_8 up)
    (adjacent loc_8_3 loc_9_3 down)
    (adjacent loc_8_3 loc_7_3 up)
    (adjacent loc_8_5 loc_7_5 up)
    (adjacent loc_8_5 loc_8_6 right)
    (adjacent loc_8_6 loc_9_6 down)
    (adjacent loc_8_6 loc_8_5 left)
    (adjacent loc_8_6 loc_7_6 up)
    (adjacent loc_8_6 loc_8_7 right)
    (adjacent loc_8_7 loc_8_6 left)
    (adjacent loc_8_7 loc_7_7 up)
    (adjacent loc_8_7 loc_8_8 right)
    (adjacent loc_8_8 loc_9_8 down)
    (adjacent loc_8_8 loc_8_7 left)
    (adjacent loc_8_8 loc_7_8 up)
    (adjacent loc_8_8 loc_8_9 right)
    (adjacent loc_8_9 loc_8_8 left)
    (adjacent loc_9_2 loc_9_3 right)
    (adjacent loc_9_3 loc_9_2 left)
    (adjacent loc_9_3 loc_8_3 up)
    (adjacent loc_9_6 loc_8_6 up)
    (adjacent loc_9_8 loc_8_8 up))
 (:goal  (and 
    (at box1 loc_6_3)
    (at box2 loc_4_8))))

; plan
1. (move loc_7_8 loc_7_7 left)
   deleted: (at-robot loc_7_8)
   added: (at-robot loc_7_7)
   goals met: 0 of 2
2. (push loc_7_7 loc_6_7 loc_5_7 up box2)
   deleted: (at-robot loc_7_7) (at box2 loc_6_7) (clear loc_5_7)
   added: (at-robot loc_6_7) (at box2 loc_5_7) (clear loc_6_7)
   goals met: 0 of 2
3. (move loc_6_7 loc_6_6 left)
   deleted: (at-robot loc_6_7)
   added: (at-robot loc_6_6)
   goals met: 0 of 2
4. (move loc_6_6 loc_5_6 up)
   deleted: (at-robot loc_6_6)
   added: (at-robot loc_5_6)
   goals met: 0 of 2
5. (push loc_5_6 loc_5_7 loc_5_8 right box2)
   deleted: (at-robot loc_5_6) (at box2 loc_5_7) (clear loc_5_8)
   added: (at-robot loc_5_7) (at box2 loc_5_8) (clear loc_5_7)
   goals met: 0 of 2
6. (move loc_5_7 loc_6_7 down)
   deleted: (at-robot loc_5_7)
   added: (at-robot loc_6_7)
   goals met: 0 of 2
7. (move loc_6_7 loc_6_8 right)
   deleted: (at-robot loc_6_7)
   added: (at-robot loc_6_8)
   goals met: 0 of 2
8. (push loc_6_8 loc_5_8 loc_4_8 up box2)
   deleted: (at-robot loc_6_8) (at box2 loc_5_8) (clear loc_4_8)
   added: (at-robot loc_5_8) (at box2 loc_4_8) (clear loc_5_8)
   goals met: 1 of 2
9. (move loc_5_8 loc_5_7 left)
   deleted: (at-robot loc_5_8)
   added: (at-robot loc_5_7)
   goals met: 1 of 2
10. (move loc_5_7 loc_5_6 left)
   deleted: (at-robot loc_5_7)
   added: (at-robot loc_5_6)
   goals met: 1 of 2
11. (move loc_5_6 loc_5_5 left)
   deleted: (at-robot loc_5_6)
   added: (at-robot loc_5_5)
   goals met: 1 of 2
12. (move loc_5_5 loc_4_5 up)
   deleted: (at-robot loc_5_5)
   added: (at-robot loc_4_5)
   goals met: 1 of 2
13. (move loc_4_5 loc_4_4 left)
   deleted: (at-robot loc_4_5)
   added: (at-robot loc_4_4)
   goals met: 1 of 2
14. (push loc_4_4 loc_5_4 loc_6_4 down box1)
   deleted: (at-robot loc_4_4) (at box1 loc_5_4) (clear loc_6_4)
   added: (at-robot loc_5_4) (at box1 loc_6_4) (clear loc_5_4)
   goals met: 1 of 2
15. (move loc_5_4 loc_5_5 right)
   deleted: (at-robot loc_5_4)
   added: (at-robot loc_5_5)
   goals met: 1 of 2
16. (move loc_5_5 loc_6_5 down)
   deleted: (at-robot loc_5_5)
   added: (at-robot loc_6_5)
   goals met: 1 of 2
17. (push loc_6_5 loc_6_4 loc_6_3 left box1)
   deleted: (at-robot loc_6_5) (at box1 loc_6_4) (clear loc_6_3)
   added: (at-robot loc_6_4) (at box1 loc_6_3) (clear loc_6_4)
   goals met: 2 of 2
